<template>
    <section class="parameters">
        <div class="container">
            <div class="parameters__content">
                <Table
                    :tableHeadings="tableHeadings"
                    :tableData="tableData"
                />
            </div>
        </div>
    </section>
</template>

<script setup>
import Table from '@/features/tables/Table.vue';

const tableHeadings = [
    'НАИМЕНОВАНИЕ',
    'РАЗМЕР СТОРОНЫ, ММ',
    'ТОЛЩИНА СТЕНКИ, ММ',
    'ВЕС 1 М. ПОГ., КГ',
    'ВЕС'
];

const tableData = [
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес'],
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес'],
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес'],
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес'],
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес'],
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес'],
    ['Наименование', 'Размер стороны, мм', 'Толщина стенки, мм', 'Вес 1 м. пог., кг', 'Вес']
];
</script>

<style lang="scss">
    @import '@/assets/styles/ui/shared/pages/catalog/parameters.scss';
</style>

